{
  "error": {
    "login":{
      "invalidcredentials":"Mật khẩu hiện tại không chính xác"
    },
    "userAndPermission":{
      "loginLocking": "Bạn đã thử đăng nhập quá 5 lần, vui lòng thử lại sau 10 phút",
      "inactiveAccount": "Tài khoản của bạn không có hiệu lực",
      "systemLocking": "Hệ thống đang chốt sổ cuối ngày, vui lòng chờ trong ít phút",
      "existedAccount": "Tài khoản này đã tồn tại",
      "emailexists":"Email này đã được sử dụng. Vui lòng chọn email khác.",
      "roleHasNoPrivilege":"Vui lòng chọn ít nhất một quyền để tạo vai trò.",
      "userHasRole":"Người dùng này đã được gán vai trò. Không thể xóa.",
      "roleHasPrivilege":"Vai trò này đã được gán quyền. Không thể xóa.",
      "roleExist": "Tên vai trò này đã được sử dụng. Vui lòng chọn tên khác",
      "imageIsTooLarge": "Kích thước ảnh quá lớn!",
      "duplicateEmail": "Email này đã được sử dụng. Vui lòng chọn email khác.",
      "duplicateCode": "Mã doanh nghiệp này đã được sử dụng cho doanh nghiệp khác"
    },
    "userManagement":{
      "emailexists":"Email này đã được sử dụng. Vui lòng chọn email khác.",
      "roleHasNoPrivilege":"Vui lòng chọn ít nhất một quyền để tạo vai trò.",
      "userHasRole":"Người dùng này đã được gán vai trò. Không thể xóa.",
      "roleHasPrivilege":"Vai trò này đã được gán quyền. Không thể xóa.",
      "roleExist": "Tên vai trò này đã được sử dụng. Vui lòng chọn tên khác",
      "imageIsTooLarge": "Kích thước ảnh quá lớn!"
    },
    "permission":{
      "duplicateManager": "Nhân viên này đã được chỉ định",
      "canNotDeleteSystemObject":"Không thể xóa bản ghi của hệ thống.",
      "canNotEditSystemObject":"Không thể sửa đổi bản ghi của hệ thống.",
      "canNotPerform":"Bạn không có quyền thực hiện tác vụ này.",
      "noPermission":"Bạn không có quyền thực hiện tác vụ này."
    },
    "common":{
      "deleteError": "Không thể xóa các bản ghi có id: ",
      "maxLengthRule":"Độ dài tối đa cho trường này là 255.",
      "referenceError":"Không thể xóa đối tượng này. Nó đã được tham chiếu bởi một đối tượng khác.",
      "existsName": "Tên đối tượng này đã tồn tại, xin thử lại",
      "failed": "Thất bại"
    },
    "warehouse":{
      "nameExist":"Tên kho đã tồn tại.",
      "codeExist":"Mã kho đã tồn tại.",
      "referenced": "Không thể xóa kho này. Nó đã được tham chiếu bới route."
    },
    "uom":{
      "nameExist":"Đơn vị đã tồn tại trong hệ thống. Vui lòng nhập lại"
    },
    "operation-type":{
      "nameExist":"Tên loại hoạt động đã tồn tại.",
      "codeExist":"Mã loại hoạt động đã tồn tại.",
      "transfer":"Loại hoạt động đã tồn tại trong một giao dịch.",
      "valuation":"Loại hoạt động đã tồn tại trong một mẫu báo cáo nhập xuất tồn.",
      "valuationOrTransfer":"Loại hoạt động đã tồn tại trong một giao dịch hoặc một mẫu báo cáo nhập xuất tồn."
    },
    "sequence": {
      "nameExist": "Tên sequence đã tồn tại.",
      "codeExist": "Mã sequence động đã tồn tại.",
      "referenced": "Không thể xóa sequence này. Nó đã được tham chiếu bởi một loại hoạt động.",
      "hasOperationTypeActive": "Can not archive this sequence. It has been referenced by an active operation type."
    },
    "uomCategory":{
      "nameExist":"Tên danh mục UOM đã tồn tại."
    },
    "locaion": {
      "delete": "Không thể xóa Location này!",
      "canNotDeleteUsedLocation": "Không thể xóa Vị Trí đang được sử dụng!",
      "canNotArchiveUsedLocation": "Không thể lưu trữ Vị Trí đang được sử dụng!",
      "canNotUpdateLocationType": "Không thể đổi kiểu của vị trí đã được dùng trong Dịch chuyển của sản phẩm!"
    },
    "transfer": {
      "existTransferNot": "Khách này chưa có đơn hàng thành công",
      "existTransfer": "Khách này đã có đơn hàng thành công",
      "invalidFee": "Không thể sửa phát sinh vì đã có phát sinh thêm khi nhập hàng",
      "invalidDelete": "Không thể xóa vì đã có dữ liệu liên quan",
      "invalidMoney": "Số tiền trả quá số nợ",
      "tooBigQuantity": "Số lượng trả quá số lượng đã giao",
      "notEnough": "Có sản phẩm không còn tồn để xuất",
      "minDate": "Ngày báo cáo lớn hơn hoặc bằng 09/09/2020",
      "zeroDebit": "Hợp đồng này không có nợ",
      "deleteType": "Không thể xóa loại phiếu đã được sử dụng",
      "cannotQuickChargeAnymore": "Đã đóng đủ các kì họ",
      "cannotInterestChargeAnyMore": "Tiền đã đóng đủ, vui lòng đóng hợp đồng",
      "cannotChangeItem": "Đã đóng họ đến kì cuối, không thể thay đổi nữa",
      "duplicateTransferCode": "Rất tiếc mã hợp đồng này đã được sử dụng",
      "notEnoughMoney": "Cửa hàng không đủ số dư để thực hiện giao dịch này",
      "finishedTransfer":"Không thể cập nhật hợp đồng đã kết thúc hoặc đã bị xóa",
      "debitOutTooBig": "Tiền nợ phải nhở hơn hoặc bằng số tiền đã thanh toán",
      "lastEarnedInterest": "Bạn phải xóa các giao dịch đóng lãi sau đó",
      "earnedInterest": "Không thể xóa giao dịch đã đóng lãi, hãy hủy các kì đóng lãi trước.",
      "smallThanLastInterestDate1": "Ngày trả gốc phải lớn hớn hoặc bằng ngày đóng lãi cuối cùng",
      "smallThanLastInterestDate2": "Ngày vay thêm phải lớn hớn ngày đóng lãi cuối cùng",
      "smallThanLastInterestDate11": "Không thể hủy vì ngày ngày đóng lãi cuối cùng lớn hơn ngày của giao dịch này",
      "smallThanLastInterestDate22": "Không thể hủy vì ngày ngày đóng lãi cuối cùng lớn hơn hoặc bằng ngày của giao dịch này",
      "expiredOriginPayment": "Ngày trả bớt gốc phải <= ngày kết thúc hợp đồng",
      "dateCondition":"Ngày Kết Thúc phải lớn hơn hoặc bằng Ngày Bắt Đầu",
      "canNotCreateDuplicateItem":"Bạn đang có 2 phần tử giống nhau. Vui lòng kiểm tra lại trước khi tạo.",
      "canNotDeleteDoneTransfer":"Không thể xóa giao dịch mà có chứa một stock move đã được đặt về trạng thái 'Done'.",
      "canNotDeleteTransferHavingOrigin":"Không thể xóa giao dịch này do nó liên kết tới một giao dịch khác.",
      "somethingWrong":"Có lỗi xảy ra. Kiểm tra log để biết thêm chi tiết hoặc liên hệ tới quản trị viên để được hỗ trợ.",
      "errorDeleteNotExist":"Bạn không thể xóa: các giao dịch mà do chúng không tồn tại",
      "errorDeleteDone":"Bạn không thể xóa: các giao dịch mà chứa một stock move đã được đặt về trạng thái 'Done'",
      "errorDeleteHavingOrigin":"Bạn không thể xóa: các giao dịch mà chúng được liên kết tới các giao dịch khác",
      "constant_select_transfer":"các giao dịch mà",
      "transfer_is_delete":"Transfer đã bị xóa!",
      "done_not_equal_reserved": "Số lượng Done phải bằng số lượng Reserved hoặc bằng 0",
      "duplicateUID":"Bị trùng UID/Serial Number hoặc Package trong tab Detailed Operations",
      "invalidState":"Transfer is done or waiting for others",
      "transferCantChange":"Giao dịch đã hoàn thành hoặc bị hủy",
      "transferInProcessing":"Giao dịch này đang được sử dụng bởi người khác",
      "validateFailed": "Đã có lỗi xảy ra trong khi xác nhận. Liên hệ với admin để xử lý.",
      "bigFile":"Tệp tin quá lớn không thể xuất",
      "initialDemandNegative": "Số lượng yêu cầu không được là số âm!",
      "invalidStateCheckAvailability":"Không xuất hàng tự động khi giao dịch đang chờ giao dịch khác",
      "existNotPackage":"Giao dịch tồn tại sản phẩm chưa được bao gói.",
      "duplicateLot":"Danh sách chi tiết hoạt động có lô bị trùng",
      "lotExistedInStock":"Có Lô đã tồn tại trong kho",
      "lotInvalidLocation":"Có Lô không tồn tại ở vị trí nguồn",
      "removeFinishTransfer":"Không được xóa giao dịch đã hoàn thành",
      "updateFinishTransfer":"Không được sửa đổi giao dịch đã hoàn thành hoặc bị hủy",
      "invalidUpdateOperation":"Không được sửa đổi Kiểu Hoạt Động khi giao dịch đã có hàng",
      "invalidUpdateLocation":"Không được sửa đổi Địa điểm khi giao dịch đã có hàng",
      "nullDestLocation":"Điểm đầu bị trống",
      "nullSrcLocation":"Điểm đến bị trống",
      "nullGln":"Điểm đầu không có GLN",
      "nullTransferItem":"Danh sách sản phẩm trống",
      "orderFinished":"Đơn đặt hàng đã hoàn thành hoặc bị hủy, vui lòng làm mới dữ liệu",
      "srcEqualDest":"Điểm Đến phải khác Điểm Đầu",
      "transferWaitingAnother": "Không thể xác nhận giao dịch này do nó liên kết tới một giao dịch khác chưa được xác nhận",
      "nullStockLocation": "Không tồn tại địa điểm kho hàng",
      "nullExportOperation": "Không tồn tại địa điểm xuất hàng",
      "nullExportLocation": "Không tồn tại địa điểm xuất hàng",
      "stockNotFound": "Không tồn tại các sản phẩm này trong kho để hoàn trả",
      "stockHasBeenReserved": "Sản phẩm/vật tư đang bị giữ hàng, xin thử lại",
      "stockHadGone": "Sản phẩm/vật tư đang còn trong kho, xin thử lại",
      "transferCantDelete" : "Không thể xóa giao dịch vì đã có dịch chuyển sản phẩm",
      "lotNotInStock" : "Lô này chưa được xác nhận, bạn có thể xóa lô",
      "ssccNotInStock" : "SSCC này chưa được xác nhận, bạn có thể xóa SSCC",
      "lotWasDeleted": "Lô đã được xóa bởi người dùng khác",
      "lotWasCancelled": "Lô đã được huỷ bởi người dùng khác",
      "lotHaventDone": "Lô chưa có số lượng hoàn thành, không thể huỷ",
      "isNotValidQuantity": "Số lượng vượt quá số lượng cho phép",
      "existsTransferDetail": "Giao dịch đã có thông tin trong tab chi tiết hoạt động không được phép xóa",
      "transferCantCancel" : "Không thể huỷ đơn hàng vì đã có dịch chuyển sản phẩm",
      "nullImportLocation": "Không tồn tại địa điểm nhập hàng"
    },
    "adjustment": {
      "adjustment_is_delete":"Phiếu kiểm kê đã bị xóa!"
    },
    "inventory": {
      "inventoryNotFound": "Không thể tìm thấy bản ghi này",
      "duplicateProduct": "Tồn tại phiếu kiểm kê khác đang trong tiến trình.",
      "startInventoryOfAllFailed":"Không thể bắt đầu phiếu điều chỉnh Tất Cả Sản Phẩm vì tồn tại một phiếu điều chỉnh khác ở vị chí này chưa hoàn thành.",
      "startFailedByInventoryOfAll":"Không thể bắt đầu phiếu điều chỉnh này vì đang có phiếu điều chỉnh Tất Cả Sản Phẩm ở vị trí này chưa hoàn thành.",
      "notFinish":"Tồn tại phiếu kiểm kê khác cùng sản phậm, cùng vị trí.",
      "importFileInvalid":"Tệp không đúng định dạng",
      "deleteFinishAdjustment":"Không thể xóa điều chỉnh kho đã hoàn thành.",
      "deleteValidateAdjustment":"Không thể xóa điều chỉnh kho đã được xác nhận.",
      "deleteInprogressAdjustment":"Không thể xóa điều chỉnh kho đang được thực thi.",
      "importTemplateError":"Mẫu không hợp lệ.",
      "importFileTooBig":"Không thể xem trước tệp với dung lượng lớn. Hãy nhập tệp này ở màn hình Chi tiết giao dịch.",
      "usingOldTemplate":"Hãy tải Mẫu mới, sau đó nhập lại",
      "reservedPartAdjustment": "Không thể bắt đầu phiếu kiểm kê. Tồn tại thùng/ UID/Serial bị giữ hàng.",
      "isReserved": "Linh kiện này đã được reserved trong giao dịch khác.",
      "notDraft": "Phiếu kiểm kê này không còn ở trạng thái NHÁP. Hãy tải lại trang và kiểm tra lịch sử.",
      "inDraft": "Phiếu kiểm kê này đã ở trạng thái NHÁP. Hãy tải lại trang và kiểm tra lịch sử.",
      "notInProgress": "Phiếu kiểm kê này không còn ở trạng thái TRONG TIẾN TRÌNH. Hãy tải lại trang và kiểm tra lịch sử.",
      "notValidate": "Phiếu kiểm kê này không còn ở trạng thái XÁC NHẬN. Hãy tải lại trang và kiểm tra lịch sử.",
      "importFileTooBig":"Tệp tải lên quá lớn"
    },
    "stock": {
      "exportEmptyData":"Không có dữ liệu"
    },
    "package" :{
      "existedInStock":"Thùng này có tồn kho lớn hơn 0.",
      "existedInAdjustment":"Thùng này đang được kiểm kê.",
      "packageNotFound":"Thùng không tồn tại trong hệ thống."
    },
    "lot" : {
      "existedInStock":"Unit Id/Serial này có tồn kho lớn hơn 0.",
      "existedInAdjustment":"Unit Id/Serial này đang được kiểm kê.",
      "lotNotFound":"Unit Id/Serial không tồn tại trong hệ thống."
    },
    "location": {
      "barcodeExist": "Barcode này đã tồn tại trong hệ thống."
    },
    "synchronize-report": {
      "batchDeleteError": "Không thể xóa vì một (một vài) báo cáo thuộc về người dùng khác. Vui lòng kiểm tra lại."
    },
    "scrap": {
      "onlyScrapped":"Bạn chỉ được chọn vật tư có trạng thái scrapped để khôi phục",
      "scrapReserved":"Vật tư đã được giữ trong giao dịch. Làm ơn bỏ giữ trước khi khôi phục",
      "scrapAdjustment":"Vật tư đã được giữ trong kiểm kê. Làm ơn bỏ giữ trước khi khôi phục"
    },
    "organization":{
      "hasBeenUsed":"Không thể xóa doanh nghiệp đã được sử dụng trong hệ thống.",
      "duplicateCode": "Mã doanh nghiệp này đã được sử dụng cho doanh nghiệp khác",
      "genGtin":"Doanh Nghiệp này không đủ điều kiện tạo GTIN",
      "invalidGtin":"Chuỗi GTIN không hợp lệ",
      "duplicateGln":"GLN đã tồn tại",
      "alreadyUsed": "Doanh nghiệp đã có dữ liệu liên kết, không thể xoá"
    },
    "role":{
      "defaultRole":" Không thể xóa vai trò mặc định của hệ thống"
    },
    "gpc":{
      "existedFamily":"Family này đã tồn tại.",
      "existedClass":"Class này đã tồn tại trong Family.",
      "existedBrick":"Brick này đã tồn tại trong Class.",
      "existedAttribute":"Attribute này đã tồn tại trong Brick.",
      "existedValue":"Value này đã tồn tại trong Attribute.",
      "deleteDefault": "Không thể xoá danh mục mặc định của hệ thống",
      "editDefault": "Không thể sửa danh mục mặc định của hệ thống",
      "familyExists": "Family đã tồn tại. Vui lòng nhập lại",
      "classExists": "Class đã tồn tại. Vui lòng nhập lại",
      "brickExists": "Brick đã tồn tại. Vui lòng nhập lại",
      "attributeExists": "Attribute đã tồn tại. Vui lòng nhập lại",
      "hasChildren": "Danh mục sản phẩm đã được sử dụng nên không được xóa",
      "valueExists": "Value đã tồn tại. Vui lòng nhập lại"
    },
    "product": {
      "duplicateName": "Sản phẩm đã tồn tại trong danh sách sản phẩm của doanh nghiệp",
      "duplicateGtin": "GTIN đã tồn tại",
      "gtinHasBeenUsed": "Mã GTIN đã được dùng cho sản phẩm của doanh nghiệp khác. Vui lòng kiểm tra lại thông tin GTIN đã nhập",
      "alreadyUsed": "Sản phẩm được gắn vào đợt sản xuất-chế biến, đơn đặt hàng hoặc giao dịch không thể xóa",
      "gtinFormatWrong": "GTIN sai định dạng"
    },
    "uomType":{
      "noPermission":"Bạn không có quyền thao tác trên bản ghi này",
      "existsTypeName": "Loại đơn vị đã tồn tại trong hệ thống. Vui lòng nhập lại",
      "existsName": "Loại đơn vị đã tồn tại trong hệ thống. Vui lòng nhập lại",
      "alreadyUsed": "Loại đơn vị này đã được sử dụng, vui lòng thử lại",
      "incorrectFile": "File tải lên sai định dạng"
    },
    "area":{
      "noPermission":"Bạn không có quyền thao tác trên bản ghi này",
      "existsName": "Khu vực này đã tồn tại, xin thử lại"
    },
    "season": {
      "existsName": "Tên đợt đã tồn tại trong hệ thống, xin thử lại",
      "cannotRenderCode": "Có lỗi xảy ra, không thể khởi tạo mã đợt",
      "invalidAccount":"Tài khoản này không đủ điều kiện để tạo đợt",
      "alreadyFinished": "Không thể xoá vì đợt đã hoàn thành",
      "alreadyUsed": "Đợt đã được sử dụng nên không được xóa",
      "existMaterial":"Không thể xóa Nhật Ký đã sử dụng vật tư",
      "canNotBeFound": "Đợt không tồn tại, xin thử lại"
    },
    "material": {
      "noPermission": "Bạn không có quyền thao tác trên bản ghi này",
      "alreadyUsed": "Danh mục này đã được sử dụng, vui lòng thử lại",
      "usedWithMaterial": "Ban không thể xóa danh mục đã được gắn với sản phẩm",
      "usedWithObject": "Vật tư đã được gắn vào đợt sản xuất-chế biến, đơn đặt hàng hoặc giao dịch không thể xóa.",
      "noPermissionOrRelateObject": "Vật tư đã được sử dụng không được phép xóa"
    },
    "materialCategory": {
      "hasChildren": "Danh mục này đã có danh mục con, không thể sửa danh mục"
    },
    "procedureLog": {
      "alreadyFinished": "Không thể xoá vì đợt đã hoàn thành hoặc nhật ký đã sử dụng vật tư"
    },
    "order": {
      "orderCantDelete": "Đơn đặt hàng đã được sử dụng không được phép xóa"
    },
    "messages": {
      "errorMaximum": "Tệp tải lên có dung lượng lớn hơn 20 MB, vui lòng nhập lại"
    },
    "gsin": {
      "Generate_GSIN": "Đối tác không thể tạo mã GSIN"
    },
    "sscc": {
      "Generate_SSCC": "Đối tác không thể tạo mã GSIN SSCC"
    },
    "trace": {
      "notFound": "Không tìm thấy thông tin cần truy xuất"
    },
    "phase": {
      "alreadyUsed": "Giai đoạn sản xuất đã được sử dụng",
      "hasNotBeenCompleted": "Giai đoạn trước đó chưa được hoàn thành"
    }
  }
}